api/app/controllers/messages_controller.rb

  def create
    Message.create(
      text: params[:message],
      video_id: params[:video_id],
      user_id: @user.id,
    )
---
INSERT INTO "messages" ("text", "user_id", "created_at", "updated_at", "video_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "1"], ["user_id", 1], ["created_at", "2018-07-23 19:26:28.905867"], ["updated_at", "2018-07-23 19:26:28.905867"], ["video_id", "jgMfYgsRvQ8"]]

  def find_user
    @user ||= User.find_by_email(params[:current_user])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "owenhflood@gmail.com"], ["LIMIT", 1]]