api/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "owenhflood@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "owenhflood@gmail.com"], ["created_at", "2018-07-23 19:26:20.037126"], ["updated_at", "2018-07-23 19:26:20.037126"]]
---
  def create
    # this is not a traditional session controller
    # it's basically just a way to make a new user
    # if the email is not registered yet
    if !User.find_by(email: email)
      User.create(email: email)