api/app/controllers/stats_controller.rb

  def index
    messages = Message
                .where(video_id: params[:video_id])
                .joins(:user)
                .where(
                  'text LIKE ? OR users.email LIKE ?',
                  "%#{params[:filter]}%",
                  "%#{params[:filter]}%"
                )

    render json: {
      messages: messages.map { |message| {
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]